# 1. შექმენით სია, სადაც გექნებათ 5 ელემენტი, შემდეგ, დადებითი ინდექსინგის გამოყენებით გამოიტანეთ მე-3 და მე-4.
list1 = ["100","200", "300", "400", "500"]
print(list[2], list[3])

# 2. შექმენით სია, სადაც გექნებათ 5 ელემენტი, შემდეგ, უარყოფითი ინდექსინგის გამოყენებით გამოიტანეთ მესამე ელემენტი.
list2 = ["100","200", "300", "400", "500"]
print(list2[-3])

# 3. შექმენით სია, სადაც გექნებათ 5 რიცხვი, შემდეგ დაპრინტე მათი მინიმალური რიცხვი და მაქსიმალური რიცხვი
list3 = ["100","200", "300", "400", "500"]
print(min(list), max(list))