# 1. ცვლადში შეინახე სტრინგი დიდი ასოებით, შემდეგ .lower() ფუნქციის მეშვეობით გადააქციე ცვლადი პატარა ასოებად. 
group = "GROUP 39"
group.lower()
print(group)

# 2. ცვლადში შეინახე სტრინგი პატარა ასოებით, შემდეგ .upper() ფუნქციის მეშვეობით გადააქციე ცვლადი დიდ ასოებად.
name = "lika"
name.upper()
print(name)

# 3. ცვლადში შეინახე სტრინგი პატარა ასოებით, შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ ასოდ.
username = "sandro"
username.capitalize()

# 4. მომხარებელს შემოატანინე სიტყვა, შემდეგ გადააქციე პატარა ასოებად და დაპრინტე
word = input("enter a word: ")
word.lower()
print(word)