# 1)შექმენით სია, რომელშიც მოცემულია კვირის დღეები:["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"].
# ამოიღეთ და დაბეჭდეთ: კვირის პირველი დღე.ბოლო დღე.
# შეცვალეთ სიის მესამე ელემენტი ("Wednesday") ახალ მნიშვნელობაზე "Midweek".

list = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]
print(list[0])
print(list[6])

# 2)მომხმარებელს სთხოვეთ, რომ შეიყვანოს ხუთი საყვარელი ცხოველის სახელი. სახელები შეინახეთ სიაში.
# მომხმარებლის მიერ შეყვანილი სიის მიხედვით:დაბეჭდეთ პირველი და ბოლო ცხოველის სახელი.შეცვალეთ სიის მეორე ცხოველის სახელი და მომხმარებლისგან მოითხოვეთ ახალი მნიშვნელობა.დაბეჭდეთ განახლებული სია.
animal_1 = input("please enter your fav animal:")
animal_2 = input("please enter your fav animal:")
animal_3 = input("please enter your fav animal:")
animal_4 = input("please enter your fav animal:")
animal_5 = input("please enter your fav animal:")
animals = [animal_1, animal_2, animal_3, animal_4, animal_5]
new_animal = input("please enter another animal:")
animals[1] = new_animal
print(animals)

# 3)შექმენით სია: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12].
# ამოიღეთ სიის ყოველი მესამე ელემენტი. ამოიღეთ სია უკუღმა. სიის შუა 6 ელემენტი გადაიტანეთ ახალ სიაში.
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
print(nums[::3]) #სიის ყოველი მესამე ელემენტი
print(nums[::-1]) #შებრუნებული სია
new_nums = nums[3:10]

# 4)შექმენით სია, რომელიც შეიცავს ათასიდან ათიათასამდე ყველა რიცხვს, რომლებიც იყოფა 500-ზე.
# გამოიყენეთ სლაისინგი, რათა ამოიღოთ:პირველი ხუთი რიცხვი.ყოველი მესამე რიცხვი.დაითვალეთ, რამდენი ელემენტია საბოლოო სიაში.
numbers = [1000, 1500, 2000, 2500, 3000, 3500, 4000, 4500, 5000, 5500, 6000, 6500, 7000, 7500, 8000, 8500, 9000, 9500, 10000]
print(numbers[:5]) #პირველი ხუთი რიცხვი
print(numbers[::3]) #ყოველი მესამე რიცხვი
new_numbers = numbers[:5] + numbers[::3]
print(len(new_numbers))

#5)მომხმარებელს სთხოვეთ, რომ შეიყვანოს 10 რიცხვი მძიმით გამოყოფილად. შეინახეთ ეს რიცხვები სიაში.
# ამ სიის მიხედვით:ამოიღეთ და დაბეჭდეთ მომხმარებლის შეყვანილი პირველი სამი რიცხვი.სიის შუა ოთხი ელემენტი გადააკოპირეთ ახალ სიაში და დაბეჭდეთ ის.შეამოწმეთ, თუ სიის ბოლო ელემენტი არის ციფრი 10.
numss = int(input("please enter 10 numbers using columns:"))
listt = [numss]