# 1. შექმენით სია, სადაც გექნებათ სიტყვები, შემდეგ გამოიტანეთ სათითაოდ ყველა სიტყვა.
words = ["headphones", "microphone", "mousepad", "PC", "disk"]
for i in words:
    for y in i.split(' '):
        print(y)

# 2. შექმენით სია, სადაც გექნებათ 5 ცალი რიცხვი, შემდეგ გამოიტანეთ სათითაოდ ყველა რიცხვი.
# numbers = [1500,346,780,890,270]
# for i in numbers:
#     print(numbers)


# 3. შექმენით სია, სადაც გექნებათ` 5 ცალი რიცხვი, შემდეგ გამოიტანეთ სათითაოდ ყველა რიცხვი გამრავლებული თავის თავზე.

# 4. შექმენით სია, სადაც გექნებათ 5 ცალი რიცხვი, შემდეგ ეს ციფრები გააორმაგეთ და დაამატეთ ახალ სიაში.
numbers = [1500,346,780,890,270]
