# 0)კომენტარის სახით ახსენით append/insert/pop/len/upper/lower/capitalize/find და დაწერეთ ინფორმაცია მათი არგუმენტების შესახებ
# < string functions - სტრინგის ფუნქციები >

# .lower() --> სტრინგი გადაჰყავს lower case-ში
# .upper() --> სტრინგი გადაჰყავს upper case-ში
# .capitalize() --> სტრინგის პირველი ასო გადაჰყავს upper case-ში
# .find("x") --> ეს ფუნქცია გიბრუნებს თუ სტრინგში რომელ ინდექსზე დგას მითითებული ასო, ამ შემთხვევაში მაგ. "x". ↓
#   • თუ () ფრჩხილებში არ მივუთითებთ ასოს, ფუნქცია ვერ იმუშავებს და გამოიტანს ერორს. 
#   • თუ () მივუთითებთ ისეთ ასოს რომელსაც სტრინგი არ შეიცავს, ფუნქცია გამოიტანს -1 ს ინდექსად.

# < built-in functions - ჩაშენებული ფუნქციები >

# len() --> აბრუნებს სიის ან სტრინგის ზომას. ამ ფუნქციას არ სჭირდება წერტილი.
# .append() --> სიის ბოლოს ამატებს ელემენტს ↓
#   • ეს ფუნქცია მხოლოდ მუშაობს სიებზე და არა სტრინგებზე, რადგან სიები შეცვლადია(mutable), ხოლო სტრინგები უცვლადი(immutable). სტრინგებზე გამოყენების შემთხვევაში მიიღებს error-ს.
# .insert() --> სიაში ამატებს ელემენტს მოცემულ ინდექსზე. მაგ items.append(1,"product") ↓
#   • ამ ფუნქციას 2 არგუმენტი გადაეცემა. პირველ არგუმენტად გადაეცემა ინდექსი, ხოლო მეორე არგუმენტად სტრინგი.
# pop() --> სიიდან შლის ელემენტს. მას არგუმენტად მხოლოდ ინდექსი გადაეცემა, მაგ. items.pop(1)



# 1)შექმენით სია, შეიყვანეთ 5 სახელი, შემდეგ მომხმარებელს შემოატანინეთ მისი სახელი, თუ სახელი შეიცავს 7-ზე მეტ სიმბოლოს მაშინ ჩაამატეთ სახელების სიაში

names = ["lika", "dato", "nika", "sandro", "anka"]
name = input("enter your name:")
if len(name) > 7:
    names.append(name)
else:
    print("no changes")
print(names)


# 2)შექმენით სია 10 ელემენტით და გამოიტანეთ მხოლოდ ლუწ ინდექსზე მდგომი ელემენტები.
list = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]
print(list[2],list[4],list[6],list[8],list[10])


# 3)შექმენით ცვლადი რომელშიც შენახული იქნება სტრინგი შემდეგ კი გაიგეთ ამ სტრინგის სიმბოლოების რაოდენობა.
artist = "radiohead"
print(len(artist))

# 4) მომხმარებელს შემოატანინეთ მისი სახელი დიდი ასოებით და შეინახეთ ცვლადში სახელად name და .lower() ფუნქციის მეშვეობით გადააქციეთ ცვლადის მნიშვნელობა  პატარა ასოებად. 

# პირველი გზა
user_name = input("enter your name in upper case: ")
user_name = user_name.lower()
# მეორენაირი გზა
user_name = input("enter your name in upper case: ").lower()


# 5) ცვლადში შეინახეთ თქვენი გვარი პატარა ასოებით, შემდეგ .upper() ფუნქციის მეშვეობით გადააქციეთ ცვლადის მნიშვნელობა  დიდ ასოებად.
surname = "chxikvadze".upper()
print(surname)

# 6) ცვლადში შეინახეთ სტრინგი პატარა ასოებით, შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ ასოდ.
rock_artist = "deftones".capitalize()
print(rock_artist)