# 1. შექმენი ცვლადი, სადაც შეინახავ სტრინგს, შემდეგ გამოიტანე იმ სტრინგის მეორე ასო.
name = "sandro"
print(name[1])

# 2. შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი ჯამი.
num1 = 14
num2 = 4
print(num1 + num2)

# 3. შექმენით 2 str ტიპის ცვლადი და გამოიტანეთ მათი შეერთებული ვერსია (ასევე კომენტარის სახით აღწერეთ რა არის კონკატენაცია).
username = "lika"
user_surname = "Chxikvadze"
print(username, user_surname)
# კონკატინაცია არის სტრინგების შეერთება

# 4. შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი განაყოფი, შემდეგ კი ახსენით რატომ გამოიტანა floatი და რა ქვია ამ convert'ს (implicit or explicit)
int1 = 10
int2 = 2
print(int1/int2)
# ამ ორი რიცხვის განაყოფმა გამოიტანა float რადგან პითონში რიცხვების გაყოფისას სრულდება implicit convert(მონაცემთა ტიპის ავტომატურად შეცვლა)

# 5. გაიხსენეთ ყველა შედარების ოპერატორი და ჩამოწერეთ ყველაზე 1 მაგალითი
numm1 = 44
numm2 = 39
print(numm1 < numm2)
print(numm1 > numm2)
print(numm1 <= numm2)
print(numm1 >= numm2)
print(numm1 == numm2)
print(numm1 != numm2)

# 6. შეურიეთ შედარების ოპერატორები და მათემატიკური ოპერაციები (მაგ: 5 + 5 == 8  + 2)
40 * 2 == 76 + 4
5666*90 != 35**2
7*3 > 8*2

# 7. გაიხსენეთ ლოგიკური ოპერატორი და ჩამოწერეთ ყველა კომბინაცია რაც საჭიროა (სულ უნდა იყოს რვა, გაიხსენეთ ნასწავლიდან)

#True and True
#True and False
#False and True
#False and False

#True or True
#True or False 
#False or True
#False or False


# 8. შეურიეთ ერთმანეთს ლოგიკური და შედარების ოპერატორები და მოიყვანეთ 5 მაგალითი
40 * 2 == 76 + 4 and 7*3 > 8*2
5666*90 != 35**2 or 14 - 3 == 1000

# 9. შექმენით for loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.
for i in range(0,11):
    print(i)

# 10. შექმენით რიცხვების list'ი, შექმენით for loop'ი list'ის რიცხვების ჯამის გამოსათვლელად.
nums = [100, 200, 250, 400]
total = 0
for num in nums:
    total += num
print(total)

# 11. შექმენით for loop'ი თითოეული სიმბოლოს დასაბეჭდად სტრინგში -> "Hello, World!".
for i in "Hello, World!":
    print(i)

# 12. შექმენით while loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.
i = 1
while i < 10:
    print(i)
    i += 1

# 13. შექმენით while loop'ი რომელიც დათვლის რიცხვებს 1დან 100მდე თუმცა გამოტოვებს რიცხვებს 50დან 60მდე.
# 14. შექმენით while loop'ი, რომელიც დაიწყებს რიცხვების შეკრებას 1-დან, სანამ ჯამი არ გაუტოლდება 50-ს.
count = 1
while count < 50:
    count += 1
    print(count)