# 1)მომხმარებელს შემოატანინეთ რაღაც რიცხვი და შემდეგ შეამოწმეთ თუ ეს რიცხვი არის ლუწი,დაბეჭდეთ "even", ხოლო თუ კენტია "odd"
num = int(input("please enter a number:"))
if num % 2 == 0 :
    print("even")
else:
    print("odd")

# 2)for loop ის საშუალებით დაბეჭდეთ 1 დან 50მდე ყველა ლუწი რიცხვი
for i in range(2,50,2):
    print(i)

# 3)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე
nums = [0,5,20,30,40,50]
for num in nums:
    if num>10:
        print(num)

# 4)შექმენით  სია,რომელიც შედგება 10 რიცხვისგან  და შემდეგ დაბეჭდეთ პირველი და ბოლო ელემენტის სხვაობა,ჯამი,ნამრავლი
nums = [1,2,3,4,5,6,7,8,9,10]

print(nums[0]-nums[9]) #სხვაობა 
print(nums[0]+nums[9]) #ჯამი
print(nums[0]*nums[9]) #ნამრავლი

# 5)(რთული)მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ ეს რიცხვი ცვლადში, შემდეგ კი შექმენით სია რომელიც შედგება 5 სახელისგან,შემდეგ გამოიტანეთ შემოტანილი რიცხვის ინდექსზე მდგომი სიის ელემენტი.
index = int(input("please enter a number:"))
names = ["lika", "nika", "vano", "anka", "sandro"]
if index>=5:
    print("choose a number that's lower than 5")
else:
    print(names[index])
